In [1]:
!pip show pandas

Name: pandas
Version: 0.24.2
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\yohan_min\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: xarray, vincent, seaborn, pysal, osmnx, odo, mapclassify, geoplot, geopandas, contextily, altair

In [50]:
import pandas as pd

In [51]:
# columns of the data frame (as lists):
names=['Qing', "Françoise", "Raúl", "Bjork"]
ages=[32,33,28,30]
country=["China", "Senegal", "Spain", "Norway"]
education=["Bach", "Bach", "Master", "PhD"]

In [52]:
# now in a dict:
dataInDict={'names':names, 'ages':ages, 'country':country, 'education':education}
# here it is:
dataInDict

{'names': ['Qing', 'Françoise', 'Raúl', 'Bjork'],
 'ages': [32, 33, 28, 30],
 'country': ['China', 'Senegal', 'Spain', 'Norway'],
 'education': ['Bach', 'Bach', 'Master', 'PhD']}

In [53]:
pd.DataFrame(dataInDict)

       names  ages  country education
0       Qing    32    China      Bach
1  Françoise    33  Senegal      Bach
2       Raúl    28    Spain    Master
3      Bjork    30   Norway       PhD

In [54]:
students=pd.DataFrame(dataInDict)

In [55]:
type(students)

pandas.core.frame.DataFrame

In [56]:
students

       names  ages  country education
0       Qing    32    China      Bach
1  Françoise    33  Senegal      Bach
2       Raúl    28    Spain    Master
3      Bjork    30   Norway       PhD

In [19]:
# one function will be available
from pandas import DataFrame as df

students=df.from_dict(dataInDict)
# here you are again:
students

       names  ages  country education
0       Qing    32    China      Bach
1  Françoise    33  Senegal      Bach
2       Raúl    28    Spain    Master
3      Bjork    30   Norway       PhD

### Series

In [13]:
students["names"] # or students.names

0         Qing
1    Françoise
2         Raúl
3        Bjork
Name: names, dtype: object

In [14]:
students['names'] # regardless of "" or ''

0         Qing
1    Françoise
2         Raúl
3        Bjork
Name: names, dtype: object

In [15]:
# and it is a:
type(students['names'])

pandas.core.series.Series

### DataFrame

In [16]:
students[['names']]

       names
0       Qing
1  Françoise
2       Raúl
3      Bjork

In [17]:
# but you have a:
type(students[['names']])

pandas.core.frame.DataFrame

In [21]:
# this is also a DF
students.iloc[:,1:4]

   ages  country education
0    32    China      Bach
1    33  Senegal      Bach
2    28    Spain    Master
3    30   Norway       PhD

In [22]:
# same as above:
students.iloc[1:3,[1,3]]

   ages education
1    33      Bach
2    28    Master

In [35]:
studentsA=students # approach 1
studentsB=students.copy() # approach 2

# If you follow approach A, the 'copy' will be affected by all changes to the original. 
# Using the function copy() ensures that does not happen.

In [38]:
students.drop(['ages'],1,inplace=True) # inplace!!!, 0 is low, 1 is column

In [39]:
students

       names  country education
0       Qing    China      Bach
1  Françoise  Senegal      Bach
2       Raúl    Spain    Master
3      Bjork   Norway       PhD

In [40]:
studentsA

       names  country education
0       Qing    China      Bach
1  Françoise  Senegal      Bach
2       Raúl    Spain    Master
3      Bjork   Norway       PhD

In [41]:
studentsB

       names  ages  country education
0       Qing    32    China      Bach
1  Françoise    33  Senegal      Bach
2       Raúl    28    Spain    Master
3      Bjork    30   Norway       PhD

In [43]:
studentsB.drop(['ages'],1,inplace=False)

       names  country education
0       Qing    China      Bach
1  Françoise  Senegal      Bach
2       Raúl    Spain    Master
3      Bjork   Norway       PhD

In [44]:
studentsB

       names  ages  country education
0       Qing    32    China      Bach
1  Françoise    33  Senegal      Bach
2       Raúl    28    Spain    Master
3      Bjork    30   Norway       PhD

### Excercise

In [62]:
names=['Michael', "Adam", "Jing"]
sex=['male','male','female']
country=["USA", "USA", "China"]
city=["Seattle", "Chicago", "Beijing"]
major=["Economics", "Sociology", "Sociology"]

# now in a dict:
dataInDict={'names':names, 'sex':sex, 'city':city, 'country':country, 'major':major}
# here it is:
dataInDict

{'names': ['Michael', 'Adam', 'Jing'],
 'sex': ['male', 'male', 'female'],
 'city': ['Seattle', 'Chicago', 'Beijing'],
 'country': ['USA', 'USA', 'China'],
 'major': ['Economics', 'Sociology', 'Sociology']}

In [63]:
df.from_dict(dataInDict)

     names     sex     city country      major
0  Michael    male  Seattle     USA  Economics
1     Adam    male  Chicago     USA  Sociology
2     Jing  female  Beijing   China  Sociology